
print("Добро пожаловать в 'Менеджер заметок'! \nВы можете добавить новую заметку!")

notes = []

note = {"Имя пользователя": input("Имя пользователя: "),
        "Заголовоки": input("Введите заголовок: "),
        "Описание": input("Описание: "),
        "Статус": input("Статус: "),
        "Дата создания": input("Дата создания в формате дд-мм-гггг, например 10-11-2024: "),
        "Дата истечения": input("Дата истечения в формате дд-мм-гггг, например 10-11-2024: ")}

notes.append(note)

while True:
        miki = input("\nХотите добавить ещё одну заметку? (да/нет): ")
        if miki == "да":
            note = {"Имя пользователя": input("Имя пользователя: "),
                    "Заголовоки": input("Введите заголовок: "),
                    "Описание": input("Описание: "),
                    "Статус": input("Статус: "),
                    "Дата создания": input("Дата создания в формате дд-мм-гггг, например 10-11-2024: "),
                    "Дата истечения": input("Дата истечения в формате дд-мм-гггг, например 10-11-2024: ")}

            notes.append(note)

        elif miki == "нет":
                print("\nСписок всех заметок:")
                for idx, note in enumerate(notes, start = 1):
                        print(f"Заметка {idx}:")
                        for key, value in note.items():
                                print(f"  {key}: {value}")
                print()
                break